Autodesk.Revit.DB.Events.ViewPrintedEventArgs.View
The view that was printed.
Since:
2010

Autodesk.Revit.DB.Events.ViewPrintedEventArgs.TotalViews
The number of all views being printed.
Since:
2010

Autodesk.Revit.DB.Events.ViewPrintedEventArgs.Index
The index of the view being printed out of the set of all views being printed.
Remarks:
The index is zero-based. When a single view is being printed, this value should be 0.
Since:
2010

Autodesk.Revit.DB.Events.ViewPrintedEventArgs
The event arguments used by the ViewPrinted event.
Since:
2010